if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "mas"
    brew "noti"
    brew "trash"

elsif OS.linux?
    brew "xclip"
end

tap "homebrew/bundle"
tap "homebrew/core"
tap "schniz/tap"

# packages
brew "ack"
brew "bat"
brew "cloc"
brew "diff-so-fancy"
brew "entr"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "grep"
brew "highlight"
brew "htop"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "markdown"
brew "neofetch"
brew "neovim"
brew "python"
brew "ripgrep"
brew "fnm"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "vim"
brew "wdiff"
brew "wget"
brew "z"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "python3"
brew "keychain"
brew "direnv"
brew "terraform"
brew "terragrunt"
brew "k9s"
brew "helm"
